[
  {
    "title": "Arti Wudhu",
    "content": "Wudlu' menurut bahasa artinya bersih dan indah, sedang menurut syara' artinya membersihkan anggota wudlu' untuk menghilangkan hadas kecil.\nOrang yang hendak melaksanakan shalat, wajib lebih dahulu berwudlu', karena wudlu' merupakan salah satu syarat sahnya shalat."
  },
  {
    "title": "Fardhu Wudhu",
    "content": "Enam perkara yang menjadi fardhu wudhu:\n\n1. Niat\n2. Membasuh muka mulai dari batas tumbuh rambut hingga bawah dagu\n3. Membasuh kedua tangan sampai siku-siku\n4. Mengusap sebagian rambut kepala\n5. Membasuh kedua kaki dampai mata kaki\n6. Tertib, artinya melakukan secara berurutan"
  },
  {
    "title": "Sunnah Wudhu",
    "content": "Sunnah-sunnah wudhu yakni hal yang dianjurkan sebelum dan selama berwudhu, antara lain:\n\n1. Membaca basmalah sebelum berwudhu\n2. Membasuh tangan sebelum berwudhu\n3. Berkumur-kumur\n4. Membasuh lubang hidung sebelum berniat\n5. Menyapu seluruh kepala dengan air\n6. Mendahulukan anggota tubuh kanan sebelum kiri\n7. Menyapu kedua telinga luar dan dalam\n8. Melakukan basuhan sebanyak 3 kali\n9. Menyela-nyela jari tangan dan kaki\n10. Membaca doa sesudah wudhu"
  },
  {
    "title": "Syarat Wudhu",
    "content": "Syarat-syarat wudhu antara lain:\n\n1. Islam\n2. Tamyiz, yakni dapat membedakan baik dan buruknya sesuatu\n3. Tidak berhadast besar\n4. Wudhu dengan air suci yang mensucikan\n5. Tidak ada sesuatu yang menghalangi air sampai ke anggota badan misal cat, getah dan sebagainya\n6. Mengetahui mana yang wajib dan mana sunnah"
  },
  {
    "title": "Tata Cara Wudhu",
    "content": "Lihat tata cara wudhu >>"
  },
  {
    "title": "Yang Membatalkan Wudhu",
    "content": "Adapun hal-hal yang dapat membatalkan wudhu antara lain:\n\n1. Keluar sesuatu dari qubul dan dubur, misal buang air kecil atau besar atau keluar angin dan sebagainya\n2. Hilang akal sebab gila, pingsan, mabuk, tidur nyenyak\n3. Tersentuh kulit antara laki dan perempuan yang bukan muhrimnya\n4. Tersentuh kemaluan dengan tapak tangan tanpa penutup"
  },
  {
    "title": "Niat Wudhu",
    "content": "نَوَيْتُ الْوُضُوْءَلِرَفْعِ الْحَدَثِ الْاَصْغَرِفَرْضًالِلّٰهِ تَعَالٰى\n\nNawaitul wudhuu-a liraf'ill hadatsil ashghari fardhal lilaahi ta’aalaa\n\nSaya niat berwudhu untuk menghilangkan hadats kecil fardu karena Allah."
  },
  {
    "title": "Doa Setelah Wudhu",
    "content": "أَشْهَدُ أَنْ لا إله إلا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَ أَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، اللّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَ اجْعَلْنِي مِنَ الْمُتَطَهِّرِين\n\nAsy-hadu an laa ilaaha illallaah wahdahu laa syariika lahu, wa asy-hadu anna muhammadan 'abduhu wa rasuuluhu, allaahummaj'alnii minat tawwaabiin, waj'alnii minal mutathahhiriin.\n\nAku bersaksi bahwa tiada Tuhan selain Allah, Yang Mahaesa, tiada sekutu bagi-Nya. Dan aku bersaksi bahwa Muhammad adalah hamba dan rasul-Nya. Ya Allah, jadikanlah aku termasuk golongan yang bertobat dan jadikanlah aku termasuk golongan yang menyucikan diri."
  }
]