[
  {
    "title": "Shalat Dhuha",
    "content": "Merupakan shalat sunah yang dilakukan pada pagi hari setelah naik matahari ukuran segalah pada pandangan mata (16 menit) setelah waktu isyrak hingga menjelang waktu dhuhur. Jumlah raka’at shalat dhuha minimal dua rakaat dan maksimal delapan rakaat menurut imam Ramli dan dua belas raka’atmenurut imam Ibnu Hajar . Manfaat dari shalat dhuha adalah supaya dilapangkan dada dalam segala hal, terutama rejeki. Saat melakukan shalat dhuha sebaiknya membaca ayat-ayat surat al-waqi’ah, adh-dhuha, al-quraisy, asy-syamsi, al-kafirun dan al-ikhlas."
  },
  {
    "title": "Shalat Hajat",
    "content": "Shalat agar hajat atau cita-citanya dikabulkan oleh Allah SWT. Shalat hajat dikerjakan bersamaan dengan ikhtiar atau usaha untuk mencapai hajat atau cita-cita. Shalat sunah hajat dilakukan minimal dua rakaat dan maksimal dua belas bisa kapan saja dengan satu salam setiap dua roka’at, namun lebih baik dilakukan pada sepertiga terakhir waktu malam."
  },
  {
    "title": "Shalat Ied",
    "content": "Shalat yang dilakukan pada hari raya idul fitri atau idul adha. Sebagaimana telah diterangkan bahwa waktu shalat hari raya idul fitri adalah tanggal 1 syawal mulai dari terbit matahari sampai tergelincirnya. Akan tetapi, jika diketahui sesudah tergelincirnya matahari bahwa hari itu tanggal 1 syawal jadi waktu shalat telah habis, maka hendaklah shalat di hari kedua atau tanggal 2 saja. Sedangkan untuk shalat hari raya Idul Adha tanggal 10 Dzulhijjah."
  },
  {
    "title": "Shalat Istikharah",
    "content": "Merupakan shalat yang tujuannya adalah untuk mendapatkan kebaikan harian atau petunjuk dari Allah SWT dalam menentukan pilihan hidup baik yang terdiri dari dua hal/perkara maupun lebih dari dua."
  },
  {
    "title": "Shalat Istishqa",
    "content": "Shalat sunah ini di lakukan untuk memohon turunnya hujan. dilakukan secara berjamaah saat musim kemarau."
  },
  {
    "title": "Shalat Khusuf",
    "content": "Kusuf adalah gerhana matahari dan khusuf adalah gerhana bulan. Shalat kusuf dan khusuf hukumnya sunnah muakaddah berdasarkan sabda Nabi saw. Yang artinya : “Sesungguhnya matahari dan bulan tidak mengalami gerhana karena kematian seseorang maupun kehidupannya. Maka apabila kalian menyaksikan itu, hendaklah kalian shalat dan berdoa kepada Allah Ta’ala.” (H.R. Syaikhain)."
  },
  {
    "title": "Shalat Rawatib",
    "content": "Merupakah shalat yang dilakukan sebelum dan setelah shalat fardhu. Yang sebelum Shalat Fardhu disebut shalat qabliyah, dan yang setelah shalat fardhu di sebut shalat Ba’diyah. Keutamaannya adalah sebagai pelengkap dan penambal shalat fardhu yang mungkin kurang khusu’ atau tidak sempurna adabnya"
  },
  {
    "title": "Shalat Safar",
    "content": "Merupakan shalat yang dilakukan oleh orang yang mau bepergian atau melakukan perjalanan selama tidak bertujuan untuk maksiat seperti pergi haji, mencari ilmu, mencari kerja, berdagang, dan sebagainya. Tujuan utamanya adalah supaya mendapat keridhaan, keselamatan dan perlindungan dari Allah SWT."
  },
  {
    "title": "Shalat Tahajjud",
    "content": "Merupakan shalat yang dikerjakan pada waktu tengah malam di antara shalat isya’ dan Shalat shubuh setelah bangun tidur. Jumlah rakaat shalat tahajud minimal dua rokaat hingga tidak  terbatas. Saat hendak kembali tidur sebaiknya membaca ayat kursi, surat al-ikhlas, surat al-falaq dan surat an-nas."
  },
  {
    "title": "Shalat Tahiyatul Masjid",
    "content": "Merupakan shalat untuk menghormati masjid. Disunnahkan shalat tahiyatul masjid bagi orang yang masuk ke masjid, sebelum ia duduk. Shalat tahiyatul masjid itu dua raka’at."
  },
  {
    "title": "Shalat Tarawih",
    "content": "Merupakan shalat malam pada bulan ramadhan hukumnya sunnah muakad atau penting bagi laki-laki atau perempuan, boleh dikerjakan sendiri-sendiri dan boleh pula berjama’ah."
  },
  {
    "title": "Shalat Tasbih",
    "content": "Merupakan shalat yang bertujuan untuk memperbanyak memahasucikan Allah SWT. Waktu pengerjaan shalat bebas. Setiap rokaat dibarengi dengan 75 kali bacaan tasbih. Jika shalat dilakukan siang hari, jumlah rakaatnya adalah empat rakaat sekali salam, sedangkan jika malam hari dengan dua salam."
  },
  {
    "title": "Shalat Taubat",
    "content": "Merupakan shalat dua roka’at yang dikerjakan bagi orang yang ingin bertaubat, insyaf atau menyesali perbuatan dosa yang telah dilakukannya dengan bertekat tidak akan melakukan serta mengulangi perbuatan dosanya tersebut. Sebaiknya shalat sunah taubat dibarengi dengan puasa, shadaqah dan shalat."
  },
  {
    "title": "Shalat Witir",
    "content": "Merupakan shalat yang dilakukan dilakukan setelah sampai sebelum fajar. bagi yang yakin akan bangun malam diutamakan dilakukan saat sepertiga malam setelah shalat Tahajud. Shalat witir disebut juga shalat penutup. biasa dilakukan sebanyak tiga rakaat dalam dua kali salam, dua rakaat pertama salam dan dilanjutkan satu rakaat lagi."
  }
]